# 나만의 데이터 직접 만들기

In [234]:
import pandas as pd

### 시리즈(Series) 만들기1

In [235]:
s = pd.Series(['banana', 42])

In [236]:
s

0    banana
1        42
dtype: object

In [237]:
print(type(s)); print(len(s))

<class 'pandas.core.series.Series'>
2

In [238]:
s[0]

'banana'

In [239]:
s[1]

42

### 시리즈(Series) 만들기2

In [240]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas', 
               'Python Expert'])

In [241]:
s

0         Wes McKinney
1    Creator of Pandas
2        Python Expert
dtype: object

In [242]:
print(type(s)); print(len(s))

<class 'pandas.core.series.Series'>
3

In [243]:
print(s[0]); print(s[1]); print(s[2])

Wes McKinney
Creator of Pandas
Python Expert

### 시리즈(Series) 만들기3

In [244]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas', 'Python Expert'],
             index = ['Person', 'Role', 'Tools'])

In [245]:
s

Person         Wes McKinney
Role      Creator of Pandas
Tools         Python Expert
dtype: object

In [246]:
print(type(s)); print(len(s))

<class 'pandas.core.series.Series'>
3

In [247]:
print(s[0]); print(s['Person'])

Wes McKinney
Wes McKinney

In [248]:
print(s[1]); print(s["Role"])

Creator of Pandas
Creator of Pandas

In [249]:
print(s[2]); print(s["Tools"])

Python Expert
Python Expert

### 데이터프레임(DataFrame) 만들기1

In [250]:
df = pd.DataFrame({
    'Name': ['Rosaline Franklin', 'William Gosset'], 
    'Occupation': ['Chemist', 'Statistician'], 
    'Born': ['1920-07-25', '1876-06-13'], 
    'Died': ['1958-04-16', '1937-10-16'], 
    'Age': [37, 61]
})

In [251]:
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [252]:
# 객체형식
type(df)

pandas.core.frame.DataFrame

In [253]:
# 객체 기본 구성내역
df.dtypes

Name          object
Occupation    object
Born          object
Died          object
Age            int64
dtype: object

In [254]:
# 객체 상세 구성내역
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
Name          2 non-null object
Occupation    2 non-null object
Born          2 non-null object
Died          2 non-null object
Age           2 non-null int64
dtypes: int64(1), object(4)
memory usage: 160.0+ bytes

In [255]:
# 객체 행열 규모
df.shape

(2, 5)

In [256]:
# 변수컬럼 목록조회
df.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [257]:
# 기술통계분석: 범주형 변수컬럼 제외
df.describe()

             Age
count   2.000000
mean   49.000000
std    16.970563
min    37.000000
25%    43.000000
50%    49.000000
75%    55.000000
max    61.000000

In [258]:
# 기술통계분석: 범주형 변수컬럼 포함
df.describe(include = 'all')

                     Name    Occupation        Born        Died        Age
count                   2             2           2           2   2.000000
unique                  2             2           2           2        NaN
top     Rosaline Franklin  Statistician  1920-07-25  1958-04-16        NaN
freq                    1             1           1           1        NaN
mean                  NaN           NaN         NaN         NaN  49.000000
std                   NaN           NaN         NaN         NaN  16.970563
min                   NaN           NaN         NaN         NaN  37.000000
25%                   NaN           NaN         NaN         NaN  43.000000
50%                   NaN           NaN         NaN         NaN  49.000000
75%                   NaN           NaN         NaN         NaN  55.000000
max                   NaN           NaN         NaN         NaN  61.000000

In [259]:
# 기술통계분석: 범주형 변수컬럼 포함
df.describe(include = 'O')

                     Name    Occupation        Born        Died
count                   2             2           2           2
unique                  2             2           2           2
top     Rosaline Franklin  Statistician  1920-07-25  1958-04-16
freq                    1             1           1           1

* 범주형데이터 기술통계분석 결과
* count     2 --> 총 2개 요소가 있음
* unique    2 --> 중복을 제외한 단독 요소는 2개임
* top       **  --> 최빈치 항목은 **이라는 요소임
* freq      1 --> 최빈치 빈도수는 **이라는 요소가 1번 나왔음
* dtype: int64

### 데이터프레임(DataFrame) 만들기2

In [260]:
# 리스트객체로 개별변수 데이터 준비
name = ['Rosaline Franklin', 'William Gosset']
occupation = ['Chemist', 'Statistician']
born = ['1920-07-25', '1876-06-13']
died = ['1958-04-16', '1937-10-16']
age = [37, 61]

In [261]:
df = pd.DataFrame({"Name":name, 
                   "Occupation":occupation, 
                   "Born":born, 
                   "Died":died, 
                   "Age":age})

In [262]:
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [263]:
# 시리즈객체로 개별변수 데이터 준비
Name = pd.Series(['Rosaline Franklin', 'William Gosset'])
Occupation = pd.Series(['Chemist', 'Statistician'])
Born = pd.Series(['1920-07-25', '1876-06-13'])
Died = pd.Series(['1958-04-16', '1937-10-16'])
Age = pd.Series([37, 61])

In [264]:
df = pd.DataFrame({"Name":Name, 
                   "Occupation":Occupation, 
                   "Born":Born, 
                   "Died":Died, 
                   "Age":Age})

In [265]:
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

### 데이터프레임(DataFrame) 만들기3

In [266]:
df = pd.DataFrame(
    data = {'Name': ['Rosaline Franklin', 'William Gosset'], 
    'Occupation': ['Chemist', 'Statistician'], 
    'Born': ['1920-07-25', '1876-06-13'], 
    'Died': ['1958-04-16', '1937-10-16'], 
    'Age': [37, 61]},
    index = ['RoFran', 'WillGo'],
    columns = ['Name', 'Born', 'Age', 'Died', 'Occupation'])
# - index가 일종의 행번호대신에 입력되는 행이름임
# - data = 에 딕셔너리형식으로 입력하는 각 변수컬럼별 입력순서는
#   columns = 에 입력하는 변수컬럼 배치순서로 재편됨

In [267]:
df

                     Name        Born  Age        Died    Occupation
RoFran  Rosaline Franklin  1920-07-25   37  1958-04-16       Chemist
WillGo     William Gosset  1876-06-13   61  1937-10-16  Statistician

In [268]:
df.index # 데이터프레임의 인덱스조회

Index(['RoFran', 'WillGo'], dtype='object')

In [269]:
df.reset_index() # 데이터프레임의 리셋된 행과 기존 행인덱스를 같이 보여줌

    index               Name        Born  Age        Died    Occupation
0  RoFran  Rosaline Franklin  1920-07-25   37  1958-04-16       Chemist
1  WillGo     William Gosset  1876-06-13   61  1937-10-16  Statistician

In [270]:
df.reset_index(drop = True) # 데이터프레임의 행 인덱스를 리셋시킴

                Name        Born  Age        Died    Occupation
0  Rosaline Franklin  1920-07-25   37  1958-04-16       Chemist
1     William Gosset  1876-06-13   61  1937-10-16  Statistician

### 특정 행 추출과 다루기

####  .loc() 이용 특정행을 시리즈(Series)로 추출

In [271]:
df.loc['RoFran']

Name          Rosaline Franklin
Born                 1920-07-25
Age                          37
Died                 1958-04-16
Occupation              Chemist
Name: RoFran, dtype: object

####  index 속성 사용하기

In [272]:
df.loc['RoFran'].index

Index(['Name', 'Born', 'Age', 'Died', 'Occupation'], dtype='object')

In [273]:
df.loc['RoFran'].index[0]

'Name'

In [274]:
df.loc['RoFran'].index[0:3]

Index(['Name', 'Born', 'Age'], dtype='object')

In [275]:
df.loc['RoFran'].index[[0, 2, 4]]

Index(['Name', 'Age', 'Occupation'], dtype='object')

#### keys() 메서드 사용하기

In [276]:
df.loc['RoFran'].keys()

Index(['Name', 'Born', 'Age', 'Died', 'Occupation'], dtype='object')

In [277]:
df.loc['RoFran'].keys()[0]

'Name'

In [278]:
df.loc['RoFran'].keys()[0:3]

Index(['Name', 'Born', 'Age'], dtype='object')

In [279]:
df.loc['RoFran'].keys()[[0, 2, 4]]

Index(['Name', 'Age', 'Occupation'], dtype='object')

####  values 속성 사용하기

In [280]:
df.loc['RoFran'].values

array(['Rosaline Franklin', '1920-07-25', 37, '1958-04-16', 'Chemist'],
      dtype=object)

In [281]:
df.loc['RoFran'].values[0]

'Rosaline Franklin'

In [282]:
df.loc['RoFran'].values[0:3]

array(['Rosaline Franklin', '1920-07-25', 37], dtype=object)

In [283]:
df.loc['RoFran'].values[[0, 2, 4]]

array(['Rosaline Franklin', 37, 'Chemist'], dtype=object)

####  get_values() 메서드 사용하기

In [284]:
df.loc['RoFran'].get_values()

array(['Rosaline Franklin', '1920-07-25', 37, '1958-04-16', 'Chemist'],
      dtype=object)

In [285]:
df.loc['RoFran'].get_values()[0]

'Rosaline Franklin'

In [286]:
df.loc['RoFran'].get_values()[0:3]

array(['Rosaline Franklin', '1920-07-25', 37], dtype=object)

In [287]:
df.loc['RoFran'].get_values()[[0, 2, 4]]

array(['Rosaline Franklin', 37, 'Chemist'], dtype=object)

### 특정 열 추출과 다루기

In [288]:
df.head()

                     Name        Born  Age        Died    Occupation
RoFran  Rosaline Franklin  1920-07-25   37  1958-04-16       Chemist
WillGo     William Gosset  1876-06-13   61  1937-10-16  Statistician

####  특정 변수컬럼을 시리즈(Series) 형식으로 추출

In [289]:
age = df['Age']
print(age)
print()
print(age.index)
print(age.keys())
print()
print(age.values)
print(age.get_values())

RoFran    37
WillGo    61
Name: Age, dtype: int64

Index(['RoFran', 'WillGo'], dtype='object')
Index(['RoFran', 'WillGo'], dtype='object')

[37 61]
[37 61]

In [290]:
print(age.count())
print(age.nunique())
print(age.sum())

print(age.mean())
print(age.min())
print(age.max())
print(age.var())
print(age.std())

2
2
98
49.0
37
61
288.0
16.97056274847714

In [291]:
age.describe()

count     2.000000
mean     49.000000
std      16.970563
min      37.000000
25%      43.000000
50%      49.000000
75%      55.000000
max      61.000000
Name: Age, dtype: float64

#### 특정 변수컬럼을 데이터프레임(DataFrame) 형식으로 추출

In [292]:
age = df[['Age']]
print(age)
print()
print(age.values)
print(age.get_values())

        Age
RoFran   37
WillGo   61

[[37]
 [61]]
[[37]
 [61]]

In [293]:
print(age.sum())
print(age.mean())
print(age.min())
print(age.max())
print(age.var())
print(age.std())

Age    98
dtype: int64
Age    49.0
dtype: float64
Age    37
dtype: int64
Age    61
dtype: int64
Age    288.0
dtype: float64
Age    16.970563
dtype: float64

In [294]:
age.describe()

             Age
count   2.000000
mean   49.000000
std    16.970563
min    37.000000
25%    43.000000
50%    49.000000
75%    55.000000
max    61.000000

# 시리즈(Series)와 불린(Boolean) 추출사용하기

In [295]:
import os
os.listdir()

['.ipynb_checkpoints',
 '01. 판다스기본.ipynb',
 '02. 판다스 데이터프레임과 시리즈(일부코드).ipynb',
 '02. 판다스 데이터프레임과 시리즈.ipynb',
 'data',
 'data2',
 'name.xls',
 'name.xlsx',
 'notebook',
 'notebook2',
 'output',
 'output2',
 'README.md',
 'Untitled.ipynb',
 'Untitled1.ipynb',
 'Untitled2.ipynb']

In [296]:
os.listdir(path = './data')

['banklist.csv',
 'billboard.csv',
 'concat_1.csv',
 'concat_2.csv',
 'concat_3.csv',
 'country_timeseries.csv',
 'gapminder.tsv',
 'name.xls',
 'name.xlsx',
 'pew.csv',
 'raw_data_urls.txt',
 'sci.xls',
 'sci.xlsx',
 'scientists.csv',
 'scientists_df.csv',
 'scientists_df.pickle',
 'scientists_df.tsv',
 'scientists_name.csv',
 'scientists_name.pickle',
 'scientists_name.tsv',
 'survey_person.csv',
 'survey_site.csv',
 'survey_survey.csv',
 'survey_visited.csv',
 'tesla_stock_quandl.csv',
 'weather.csv']

In [297]:
sci = pd.read_csv('./data/scientists.csv')

In [298]:
sci.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [299]:
# 객체형식
type(sci)

pandas.core.frame.DataFrame

In [300]:
# 객체 기본 구성내역
sci.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [301]:
# 객체 상세 구성내역
sci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
Name          8 non-null object
Born          8 non-null object
Died          8 non-null object
Age           8 non-null int64
Occupation    8 non-null object
dtypes: int64(1), object(4)
memory usage: 400.0+ bytes

In [302]:
# 객체 행열 규모
sci.shape

(8, 5)

In [303]:
# 변수컬럼 목록조회
sci.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [304]:
# 기술통계분석: 범주형 변수컬럼 제외
sci.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [305]:
# 기술통계분석: 범주형 변수컬럼 포함
sci.describe(include = 'all')

               Name        Born        Died        Age Occupation
count             8           8           8   8.000000          8
unique            8           8           8        NaN          7
top     Marie Curie  1907-05-27  1954-06-07        NaN    Chemist
freq              1           1           1        NaN          2
mean            NaN         NaN         NaN  59.125000        NaN
std             NaN         NaN         NaN  18.325918        NaN
min             NaN         NaN         NaN  37.000000        NaN
25%             NaN         NaN         NaN  44.000000        NaN
50%             NaN         NaN         NaN  58.500000        NaN
75%             NaN         NaN         NaN  68.750000        NaN
max             NaN         NaN         NaN  90.000000        NaN

### 특정변수컬럼 기술통계

In [306]:
age = sci['Age']
print(age)
print()
print(age.values)
print(age.get_values())

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

[37 61 90 66 56 45 41 77]
[37 61 90 66 56 45 41 77]

In [307]:
print(age.sum())
print(age.mean())
print(age.min())
print(age.max())
print(age.var())
print(age.std())

473
59.125
37
90
335.8392857142857
18.325918413937288

In [308]:
age.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

### 특정변수컬럼 불린추출

In [309]:
# 각 나이를 평균나이와 비교: 불(Bool) 연산
age > age.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [310]:
# 각 나이 중에서 평균나이보다 큰 나이요소(elements)를 불(Bool) 연산으로 추출
print('평균나이 =', age.mean())
print()
print(age[age > age.mean()])

평균나이 = 59.125

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [311]:
# 각 나이 중에서 특정나이보다 큰 나이요소(elements)를 불(Bool) 연산으로 추출
print(age[age > 42])

1    61
2    90
3    66
4    56
5    45
7    77
Name: Age, dtype: int64

In [312]:
# 각 나이 중에서 특정나이보다 큰 나이요소(elements)를 불(Bool) 연산으로 추출
print(age[(age > 42) & (age <= 60)])

4    56
5    45
Name: Age, dtype: int64

# 시리즈(Series)와 브로드캐스팅(Broadcastig)
* 시리즈는 여러 요소를 가지고 있는 벡터이며, 여러 요소들에 대해서 한 번에 연산하는 작업을 브로드캐스팅이라고 함

### 길이가 서로 같은 벡터의 연산

In [313]:
age + age

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [314]:
age - age

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
Name: Age, dtype: int64

In [315]:
age * age

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [316]:
age / age

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
5    1.0
6    1.0
7    1.0
Name: Age, dtype: float64

In [317]:
age + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [318]:
age - 100

0   -63
1   -39
2   -10
3   -34
4   -44
5   -55
6   -59
7   -23
Name: Age, dtype: int64

In [319]:
age * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [320]:
age / 2

0    18.5
1    30.5
2    45.0
3    33.0
4    28.0
5    22.5
6    20.5
7    38.5
Name: Age, dtype: float64

### 길이가 서로 다른 벡터의 연산

In [321]:
# 기존 age벡터 조회
print(age); print()
print(len(age))

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

8

In [322]:
# 길이가 다른 벡터2를 시리즈객체로 생성
age2 = pd.Series([33, 51, 63])
print(age2); print()
print(len(age2))

0    33
1    51
2    63
dtype: int64

3

In [323]:
# 길이가 다른 벡터간 연산시 일치하는 인덱스에 있는 요소(elements)간 연산만 진행됨
# 나머지 어느 한쪽에만 존재하는 인덱스 요소들의 경우에는 NaN(결측값)으로 처리함
print(age + age2)
print()
print(len(age + age2))

0     70.0
1    112.0
2    153.0
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

8

In [324]:
# 길이가 다른 벡터간 연산시 일치하는 인덱스에 있는 요소(elements)간 연산만 진행됨
# 나머지 어느 한쪽에만 존재하는 인덱스 요소들의 경우에는 NaN(결측값)으로 처리함
print(age - age2)
print()
print(len(age - age2))

0     4.0
1    10.0
2    27.0
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64

8

In [325]:
# 길이가 다른 벡터간 연산시 일치하는 인덱스에 있는 요소(elements)간 연산만 진행됨
# 나머지 어느 한쪽에만 존재하는 인덱스 요소들의 경우에는 NaN(결측값)으로 처리함
print(age * age2)
print()
print(len(age * age2))

0    1221.0
1    3111.0
2    5670.0
3       NaN
4       NaN
5       NaN
6       NaN
7       NaN
dtype: float64

8

In [326]:
# 길이가 다른 벡터간 연산시 일치하는 인덱스에 있는 요소(elements)간 연산만 진행됨
# 나머지 어느 한쪽에만 존재하는 인덱스 요소들의 경우에는 NaN(결측값)으로 처리함
print(age / age2)
print()
print(len(age / age2))

0    1.121212
1    1.196078
2    1.428571
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
dtype: float64

8

### 벡터를 소팅하기

##### 인덱스를 기준으로 정렬

In [327]:
print(age); print()
age_idx_asc = age.sort_index() # 인덱스를 기준으로 오름차순 정렬
print(age_idx_asc); print()
age_idx_dsc = age.sort_index(ascending = False) # 인덱스를 기준으로 내림차순 정렬
print(age_idx_dsc)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [328]:
# 시리즈객체의 경우 벡터연산시 인덱스를 기준으로 수행함
age + age_idx_dsc

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

##### 실제 요소값을 기준으로 정렬

In [329]:
print(age); print()
age_val_asc = age.sort_values() # 실제 요소값을 기준을 오름차순 정렬
print(age_val_asc); print()
age_val_dsc = age.sort_values(ascending = False) # 실제 요소값을 기준으로 내림차순 정렬
print(age_val_dsc)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

0    37
6    41
5    45
4    56
1    61
3    66
7    77
2    90
Name: Age, dtype: int64

2    90
7    77
3    66
1    61
4    56
5    45
6    41
0    37
Name: Age, dtype: int64

##### 시리즈객체의 벡터연산시 요소들의 위치가 아닌 인덱스를 기준으로 수행

In [330]:
# 시리즈객체의 경우 벡터연산시 인덱스를 기준으로 수행함
age + age_val_dsc

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

##### 시리즈객체의 인덱스 리셋

In [340]:
print(age_val_dsc)

2    90
7    77
3    66
1    61
4    56
5    45
6    41
0    37
Name: Age, dtype: int64

In [341]:
age_val_dsc.reset_index() # 리셋된 인덱스와 원래 인덱스를 같이 보여줌

   index  Age
0      2   90
1      7   77
2      3   66
3      1   61
4      4   56
5      5   45
6      6   41
7      0   37

In [342]:
age_val_dsc.reset_index(drop = True) # 새롭게 리셋된 인덱스를 보여줌

0    90
1    77
2    66
3    61
4    56
5    45
6    41
7    37
Name: Age, dtype: int64

In [343]:
age3 = age_val_dsc.reset_index(drop = True) # 새롭게 리셋된 인덱스를 보여줌
age3

0    90
1    77
2    66
3    61
4    56
5    45
6    41
7    37
Name: Age, dtype: int64

In [346]:
age + age3 # 원본 age변수와 내림차순으로 정렬후 리셋인덱싱된 age3변수간 벡터연산

0    127
1    138
2    156
3    127
4    112
5     90
6     82
7    114
Name: Age, dtype: int64

# 데이터프레임의 불린(Boolean)연산과 <br />브로드캐스팅(Broadcasting)

In [203]:
sci

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

### 불(Bool) 논리연산을 통한 특정 행 추출

In [204]:
# 불(Bool) 논리연산
sci['Age'] > sci['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [205]:
# 불(Bool) 논리연산을 통한 특정 행 추출
sci[sci['Age'] > sci['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [206]:
# 불(Bool) 논리연산을 통한 특정 행 추출
sci.loc[sci['Age'] > sci['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [351]:
# 불(Bool) 논리연산을 통한 특정 행 추출
sci[sci['Occupation'] 
    == 'Chemist']

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist
3        Marie Curie  1867-11-07  1934-07-04   66    Chemist

In [350]:
# 불(Bool) 논리연산을 통한 특정 행 추출
sci[(sci['Occupation'] == 'Chemist') 
    & (sci['Age'] <= 50)]

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist

### 데이터프레임에 대한 브로드캐스팅(Broadcasting)

In [209]:
# 문자열 요소들은 2배로 길어지며, 숫자 요소들은 곱하기 2가 됨
sci * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

# 데이터프레임 특정변수의 형식변환

### 기본 숫자 데이터를 Series(시리즈) 객체로 생성

In [358]:
ex = pd.Series([1, 2, 3, 3, 4], dtype='int32')
print(ex)
print(type(ex))
print(ex.dtype)
ex.describe()

0    1
1    2
2    3
3    3
4    4
dtype: int32
<class 'pandas.core.series.Series'>
int32

count    5.000000
mean     2.600000
std      1.140175
min      1.000000
25%      2.000000
50%      3.000000
75%      3.000000
max      4.000000
dtype: float64

### 기본 숫자 데이터 int64형식으로 변경

In [359]:
ex_int64 = ex.astype('int64')
print(ex_int64)
print(type(ex_int64))
print(ex_int64.dtype)
ex_int64.describe()

0    1
1    2
2    3
3    3
4    4
dtype: int64
<class 'pandas.core.series.Series'>
int64

count    5.000000
mean     2.600000
std      1.140175
min      1.000000
25%      2.000000
50%      3.000000
75%      3.000000
max      4.000000
dtype: float64

### 기본 숫자 데이터 flot64형식으로 변경

In [363]:
ex_float64 = ex.astype('float64')
print(ex_float64)
print(type(ex_float64))
print(ex_float64.dtype)
ex_float64.describe()

0    1.0
1    2.0
2    3.0
3    3.0
4    4.0
dtype: float64
<class 'pandas.core.series.Series'>
float64

count    5.000000
mean     2.600000
std      1.140175
min      1.000000
25%      2.000000
50%      3.000000
75%      3.000000
max      4.000000
dtype: float64

### 기본 숫자 데이터를 object(문자열) 형식으로 변경

In [356]:
ex_obj = ex.astype('object')
print(ex_obj)
print(type(ex_obj))
print(ex_obj.dtype)
ex_obj.describe()

0    1
1    2
2    3
3    3
4    4
dtype: object
<class 'pandas.core.series.Series'>
object

count     5
unique    4
top       3
freq      2
dtype: int64

* ex_obj객체 기술통계분석결과 
* count     5 --> 총 5개 요소가 있음
* unique    4 --> 중복을 제외한 요소는 4개임
* top       3 --> 최빈치 항목은 3이라는 숫자임
* freq      2 --> 최빈치 빈도수는 3이라는 숫자가 2번 나왔음
* dtype: int64

### 기본 숫자 데이터를 category(범주) 형식으로 변경

In [226]:
ex_ct = ex.astype('category')
print(ex_ct)
print(type(ex_ct))
print(ex_ct.dtype)
ex_ct.describe()

0    1
1    2
2    3
3    4
dtype: category
Categories (4, int64): [1, 2, 3, 4]
<class 'pandas.core.series.Series'>
category

count     4
unique    4
top       4
freq      1
dtype: int64

### 기본 숫자 데이터를 ordered category(서열형 범주) 형식으로 변경

In [223]:
ex_ct_ord = ex.astype('category', ordered = True, categories = [2, 1, 4, 3])
print(ex_ct_ord)
print(type(ex_ct_ord))
print(ex_ct_ord.dtype)
ex_ct_ord.describe()

0    1
1    2
2    3
3    4
dtype: category
Categories (4, int64): [2 < 1 < 4 < 3]
<class 'pandas.core.series.Series'>
category

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: specifying 'categories' or 'ordered' in .astype() is deprecated; pass a CategoricalDtype instead
  """Entry point for launching an IPython kernel.

count     4
unique    4
top       3
freq      1
dtype: int64

### 다시 sci 데이터프레임 객체 사용

In [211]:
sci

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [212]:
sci.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [213]:
sci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
Name          8 non-null object
Born          8 non-null object
Died          8 non-null object
Age           8 non-null int64
Occupation    8 non-null object
dtypes: int64(1), object(4)
memory usage: 400.0+ bytes

### 문자열 객체를 날짜시간객체로 변환

##### 문자열 객체인 Born(생일) 변수컬럼을 날짜시간 객체로 변형

In [ ]:
# 생일 변수컬럼 객체형식 파악
print(sci['Born'])
print()
print(sci['Born'].dtype)

In [ ]:
# 생일 변수컬럼을 날짜시간 객체로 변환
born_dt = pd.to_datetime(sci['Born'], format = '%Y-%m-%d')
print(born_dt)
print()
print(born_dt.dtype)

In [ ]:
# 새로운 날짜시간 변수컬럼을 기존 데이터프레임에 파생변수로 추가
sci['born_dt'] = born_dt
sci.head()

##### 문자열 객체인 Died(사망일) 변수컬럼을 날짜시간 객체로 변형

In [ ]:
# 사망일 변수컬럼 객체형식 파악
print(sci['Died'])
print()
print(sci['Died'].dtype)

In [ ]:
# 사망일 변수컬럼을 날짜시간 객체로 변환
died_dt = pd.to_datetime(sci['Died'], format = '%Y-%m-%d')
print(died_dt)
print()
print(died_dt.dtype)

In [ ]:
# 새로운 날짜시간 변수컬럼을 기존 데이터프레임에 파생변수로 추가
sci['died_dt'] = died_dt
sci.head()

##### 생일과 사망일을 이용한 시간계산

In [ ]:
sci['days_dt'] = sci['died_dt'] - sci['born_dt']
sci

# 시리즈, 데이터프레임 데이터 섞기

In [ ]:
sci['Age']

In [ ]:
import random

random.seed(100)

random.shuffle(sci['Age'])
sci['Age']

In [ ]:
sci

# 데이터프레임 열 삭제하기

In [ ]:
sci.columns

In [ ]:
sci2 = sci.drop(['Born'], axis = 1)

In [ ]:
sci2

# <font color = "blue">데이터 저장하고 불러오기</font>

### 특정변수컬럼을 pickle 바이너리 파일로 저장/로딩 하기

In [ ]:
name = sci['Name']
name

In [ ]:
name.to_pickle('./data/scientists_name.pickle')

In [ ]:
os.listdir('./data')

In [ ]:
sci_name = pd.read_pickle('./data/scientists_name.pickle')
sci_name

### 데이터프레임을 pickle 바이너리 파일로 저장/로딩 하기

In [ ]:
sci.to_pickle('./data/scientists_df.pickle')

In [ ]:
os.listdir('./data')

In [ ]:
scientists = pd.read_pickle('./data/scientists_df.pickle')
scientists

### 특정변수컬럼을 csv/tsv 파일로 저장/로딩 하기

In [ ]:
name = sci['Name']
name

In [ ]:
name.to_csv('./data/scientists_name.csv')
name.to_csv('./data/scientists_name.tsv', sep = '\t')

In [ ]:
os.listdir('./data')

In [ ]:
sci_name_csv = pd.read_csv('./data/scientists_name.csv')
sci_name_tsv = pd.read_csv('./data/scientists_name.tsv', sep = '\t')
print(sci_name_csv)
print()
print(sci_name_tsv)

### 데이터프레임을 csv/tsv 파일로 저장/로딩 하기

In [ ]:
sci.to_csv('./data/scientists_df.csv')
sci.to_csv('./data/scientists_df.tsv', sep = '\t')

In [ ]:
os.listdir('./data')

In [ ]:
scientists_csv = pd.read_csv('./data/scientists_df.csv')
scientists_tsv = pd.read_csv('./data/scientists_df.tsv', sep = '\t')
print(scientists_csv)
print()
print(scientists_tsv)

### 특정변수컬럼을 엑셀 파일로 저장/로딩 하기

In [ ]:
name = sci['Name']
name

In [ ]:
# 시리즈 형식을 엑셀로 저장하려면 데이터프레임 구조로 변환필요
name_fr = name.to_frame()
print(name_fr)
print(type(name_fr))

In [ ]:
# .xls 확장자를 가진 엑셀파일로 저장
import xlwt
name_fr.to_excel('./data/name.xls')

# .xlsx 확장자를 가진 엑셀파일로 저장
import openpyxl
name_fr.to_excel('./data/name.xlsx')

In [ ]:
os.listdir('./data')

In [ ]:
sci_name_xls = pd.read_excel('./data/name.xls')
sci_name_xlsx = pd.read_excel('./data/name.xlsx')
print(sci_name_xls)
print()
print(sci_name_xlsx)

### 데이터프레임을 엑셀 파일로 저장/로딩 하기

In [ ]:
# .xls 확장자를 가진 엑셀파일로 저장
import xlwt
sci.to_excel('./data/sci.xls')

# .xlsx 확장자를 가진 엑셀파일로 저장
import openpyxl
sci.to_excel('./data/sci.xlsx')

In [ ]:
os.listdir('./data')

In [ ]:
sci_xls = pd.read_excel('./data/sci.xls')
sci_xlsx = pd.read_excel('./data/sci.xlsx')
print(sci_xls)
print()
print(sci_xlsx)

# End of Source